[
  {
    "id": "projet1",
    "title": "Sophie Bluel",
    "cover": "/img/projects/sophie-bluel/main-page.webp",
    "codeLink": "https://github.com/LaflorentieNicolas/P3-Portfolio-Sophie-Bluel",
    "webSite": "",
    "pictures": [
      "/img/projects/sophie-bluel/main-page.webp",
      "/img/projects/sophie-bluel/modal.webp",
      "/img/projects/sophie-bluel/ajouter-une-photo.webp"
    ],
    "language": [
      "/img/logo/language/htmlLogo.svg",
      "/img/logo/language/cssLogo.svg",
      "/img/logo/language/jsLogo.svg",
      "/img/logo/language/nodeLogo.svg",
      "/img/logo/language/githubLogo.svg"
    ],
    "languageNames": ["HTML", "CSS", "JavaScript", "Node.js", "GitHub"],
    "description": "Il s'agit d'un projet pédagogique développé lors de ma formation OpenClassrooms. J'ai développé une interface dynamique pour le portfolio d'une architecte en intégrant les fonctionnalités nécessaires à la gestion et à l'affichage de ses réalisations. À partir du design fourni via Figma, j'ai transformé une version statique de la page en une application interactive capable de communiquer avec une API back-end pour récupérer et afficher les projets de l'architecte. L'une des principales difficultés a été de faire interagir efficacement le front-end avec l'API back-end pour gérer la persistance des données. J'ai résolu ce problème en utilisant des outils comme Swagger pour tester et comprendre les différentes routes de l'API, ce qui m'a permis de configurer correctement les appels API avec fetch. J'ai également mis en place une fenêtre modale fonctionnelle pour ajouter, supprimer des médias dans la galerie, en veillant à ce qu'elle se déclenche et se ferme correctement en fonction des actions de l'utilisateur. Ce projet m'a permis de renforcer mes compétences en JavaScript, notamment en manipulation du DOM et en gestion d'événements, ainsi qu'en intégration d'API."
  },
  {
    "id": "projet2",
    "title": "Kasa",
    "cover": "/img/projects/kasa/main-page.webp",
    "codelink": "https://github.com/LaflorentieNicolas/P6-Kasa",
    "webSite": "https://laflorentie-nicolas-p6-kasa.netlify.app/",
    "pictures": [
      "/img/projects/kasa/main-page.webp",
      "/img/projects/kasa/about.webp",
      "/img/projects/kasa/housing.webp"
    ],
    "language": [
      "/img/logo/language/reactLogo.svg",
      "/img/logo/language/sassLogo.svg",
      "/img/logo/language/githubLogo.svg"
    ],
    "languageNames": ["React", "Sass", "GitHub"],
    "description": "Il s'agit d'un projet pédagogique développé lors de ma formation OpenClassrooms. Dans ce projet, j'ai développé une application de location d'appartements en utilisant React. Mon objectif était de créer cette application en suivant les maquettes Figma. Je me suis appuyé sur un fichier JSON simulant les données du backend. J'ai ainsi pu créer les composants React et les intégrer avec les routes (React Router) pour gérer la navigation entre les différentes pages de l'application. J’ai dû mettre en place la galerie d'images des logements et les menus déroulants (Collapse), en respectant notamment l'affichage des images et l'animation des composants, en m'assurant que tout fonctionnait correctement sur différentes tailles d'écran. Ce projet m'a permis de renforcer mes compétences en React, notamment dans la gestion des états et des composants réutilisables, ainsi qu'en Sass pour la gestion des styles. J'ai également acquis une meilleure compréhension de l'intégration de maquettes Figma dans un projet web et de l'importance de suivre des guidelines."
  },
  {
    "id": "projet3",
    "title": "Mon vieux Grimoire",
    "cover": "/img/projects/mon-vieux-grimoire/main-page.webp",
    "codelink": "https://github.com/LaflorentieNicolas/P7-Mon-Vieux-Grimoire-backend",
    "webSite": "",
    "pictures": [
      "/img/projects/mon-vieux-grimoire/main-page.webp",
      "/img/projects/mon-vieux-grimoire/ajout-livre.webp",
      "/img/projects/mon-vieux-grimoire/ajout-note.webp"
    ],
    "language": [
      "/img/logo/language/expressLogo.svg",
      "/img/logo/language/nodeLogo.svg",
      "/img/logo/language/mongodbLogo.svg"
    ],
    "languageNames": ["Express", "Node.js", "MongoDB"],

    "description": "Il s'agit d'un projet pédagogique développé lors de ma formation OpenClassrooms. Dans le cadre du projet 'Mon vieux grimoire', j'ai développé le backend d’une application de notation de livres, avec des fonctionnalités d'affichage, de création, de modification et de notation en suivant la gestion de données CRUD.\n\nL'une des principales tâches était d'implémenter une authentification sécurisée des utilisateurs, en intégrant le stockage des informations sur MongoDB, le cryptage des mots de passe avec Bcrypt, et l'utilisation de tokens JWT pour sécuriser les requêtes via un middleware d'authentification.\n\nCe projet m'a permis de renforcer mes compétences en développement full stack, en particulier avec Node.js, Express, MongoDB, et Mongoose. J'ai également découvert la gestion d'images avec Multer et Sharp, et la sécurité d’une application avec helmet et rate-limiting."
  }
]
